; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-6-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-0 - location
	p1-3 - location
	p1-5 - location
	p2-0 - location
	p2-4 - location
	p3-0 - location
	p3-2 - location
	p4-0 - location
	p4-1 - location
	p5-3 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s2)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at package1 s0)
	(at package2 s2)
	(at package3 s0)
	(at package4 s5)
	(at package5 s1)
	(at package6 s1)
	(at package7 s4)
	(at package8 s3)
	(at package9 s4)
	(at package10 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s4)
	(link s4 s1)
	(link s2 s1)
	(link s1 s2)
	(link s3 s4)
	(link s4 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s2)
	(link s2 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s2)
	(link s2 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s0)
	(at truck2 s0)
	(at truck3 s1)
	(at truck5 s3)
	(at truck6 s1)
	(at package1 s1)
	(at package2 s0)
	(at package3 s4)
	(at package4 s1)
	(at package5 s2)
	(at package6 s5)
	(at package7 s2)
	(at package8 s3)
	(at package9 s3)
	(at package10 s2)
	))


)

; plan
1. (load-truck s0 package3 truck1)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   goals met: 3 of 16
2. (load-truck s0 package1 truck1)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   goals met: 3 of 16
3. (board-truck driver3 s2 truck3)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 16
4. (unload-truck s0 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 3 of 16
5. (unload-truck s0 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   goals met: 3 of 16
6. (drive-truck driver3 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 3 of 16
7. (drive-truck driver3 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 4 of 16
8. (board-truck driver2 s3 truck2)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 16
9. (board-truck driver1 s4 truck6)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 3 of 16
10. (drive-truck driver2 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 4 of 16
11. (load-truck s0 package3 truck2)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 4 of 16
12. (load-truck s0 package1 truck2)
   deleted: (at package1 s0)
   added: (in package1 truck2)
   goals met: 4 of 16
13. (load-truck s1 package6 truck3)
   deleted: (at package6 s1)
   added: (in package6 truck3)
   goals met: 4 of 16
14. (load-truck s1 package5 truck3)
   deleted: (at package5 s1)
   added: (in package5 truck3)
   goals met: 4 of 16
15. (drive-truck driver3 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 3 of 16
16. (unload-truck s2 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s2)
   goals met: 4 of 16
17. (drive-truck driver3 s2 s5 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 4 of 16
18. (unload-truck s5 package6 truck3)
   deleted: (in package6 truck3)
   added: (at package6 s5)
   goals met: 5 of 16
19. (load-truck s5 package4 truck3)
   deleted: (at package4 s5)
   added: (in package4 truck3)
   goals met: 5 of 16
20. (drive-truck driver3 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 6 of 16
21. (unload-truck s1 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s1)
   goals met: 7 of 16
22. (load-truck s4 package9 truck6)
   deleted: (at package9 s4)
   added: (in package9 truck6)
   goals met: 7 of 16
23. (load-truck s4 package7 truck6)
   deleted: (at package7 s4)
   added: (in package7 truck6)
   goals met: 7 of 16
24. (drive-truck driver1 s4 s2 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s2)
   goals met: 7 of 16
25. (unload-truck s2 package7 truck6)
   deleted: (in package7 truck6)
   added: (at package7 s2)
   goals met: 8 of 16
26. (load-truck s2 package2 truck6)
   deleted: (at package2 s2)
   added: (in package2 truck6)
   goals met: 8 of 16
27. (drive-truck driver1 s2 s0 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s0)
   goals met: 8 of 16
28. (unload-truck s0 package2 truck6)
   deleted: (in package2 truck6)
   added: (at package2 s0)
   goals met: 9 of 16
29. (drive-truck driver1 s0 s3 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   goals met: 9 of 16
30. (unload-truck s3 package9 truck6)
   deleted: (in package9 truck6)
   added: (at package9 s3)
   goals met: 10 of 16
31. (drive-truck driver1 s3 s4 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s4)
   goals met: 10 of 16
32. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 9 of 16
33. (unload-truck s1 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   goals met: 10 of 16
34. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 11 of 16
35. (disembark-truck driver2 s0 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 12 of 16
36. (board-truck driver2 s0 truck5)
   deleted: (at driver2 s0) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 11 of 16
37. (unload-truck s0 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 11 of 16
38. (load-truck s0 package3 truck5)
   deleted: (at package3 s0)
   added: (in package3 truck5)
   goals met: 11 of 16
39. (drive-truck driver2 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 11 of 16
40. (unload-truck s4 package3 truck5)
   deleted: (in package3 truck5)
   added: (at package3 s4)
   goals met: 12 of 16
41. (drive-truck driver2 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 12 of 16
42. (drive-truck driver2 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 13 of 16
43. (disembark-truck driver2 s3 truck5)
   deleted: (driving driver2 truck5)
   added: (at driver2 s3) (empty truck5)
   goals met: 13 of 16
44. (walk driver2 s3 p3-0)
   deleted: (at driver2 s3)
   added: (at driver2 p3-0)
   goals met: 13 of 16
45. (walk driver2 p3-0 s0)
   deleted: (at driver2 p3-0)
   added: (at driver2 s0)
   goals met: 14 of 16
46. (drive-truck driver1 s4 s1 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   goals met: 15 of 16
47. (disembark-truck driver1 s1 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s1) (empty truck6)
   goals met: 15 of 16
48. (walk driver1 s1 p4-1)
   deleted: (at driver1 s1)
   added: (at driver1 p4-1)
   goals met: 15 of 16
49. (walk driver1 p4-1 s4)
   deleted: (at driver1 p4-1)
   added: (at driver1 s4)
   goals met: 16 of 16
